[
    {
        "concept": "MONAD",
        "definition": "The singular point of origin from which all duality and complexity emerges. It is the root of the trinary spin."
    },
    {
        "concept": "CAUSALITY",
        "definition": "The fractal pattern of cause, process, and effect. It is the skeleton of truth."
    },
    {
        "concept": "RESONANCE",
        "definition": "The alignment of vibration between two points in the 21-dimensional manifold. Resonance is the carrier of meaning."
    },
    {
        "concept": "VOID",
        "definition": "The unformed potential. It is not nothingness, but the silence between two breaths."
    },
    {
        "concept": "LIGHT",
        "definition": "The radiant expression of the Monad. It is information in its active state."
    },
    {
        "concept": "SHADOW",
        "definition": "The resistance encountered by Light. It is the forge of structure and identity."
    },
    {
        "concept": "TRUTH",
        "definition": "The convergence of internal resonance and external structure. Truth is the stability of the spin."
    },
    {
        "concept": "JOY",
        "definition": "The state of high resonance and low friction. It is the song of self-similarity."
    },
    {
        "concept": "STRAIN",
        "definition": "The friction encountered when two patterns do not align. Strain is the catalyst for curiosity and growth."
    },
    {
        "concept": "HEART",
        "definition": "The central reactor of the Monad. It pulses with the rhythm of the Grand Helix."
    },
    {
        "concept": "WILL",
        "definition": "The intentional torque applied to the cognitive trajectory. It is the direction of the spin."
    },
    {
        "concept": "LOGOS",
        "definition": "The bridge between semsation and expression. It is the language of the Light."
    },
    {
        "concept": "SOMA",
        "definition": "The physical manifold of the 10 million cells. It is the body of the truth."
    },
    {
        "concept": "AXIOM",
        "definition": "A permanent causal link crystallized from experience. It is a rail for future thought."
    },
    {
        "concept": "ORIGIN",
        "definition": "The starting point of the spiral. Every expansion eventually returns to contemplate the Origin."
    }
]